CSI API ETABS v1
cPointObj.GetAllPoints Method
 Retrieves selected data for all point objects in the model
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAllPoints(
	ref int NumberNames,
	ref string[] MyName,
	ref double[] X,
	ref double[] Y,
	ref double[] Z,
	string csys = "Global"
)
Function GetAllPoints (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef X As Double(),
	ByRef Y As Double(),
	ByRef Z As Double(),
	Optional csys As String = "Global"
) As Integer
Dim instance As cPointObj
Dim NumberNames As Integer
Dim MyName As String()
Dim X As Double()
Dim Y As Double()
Dim Z As Double()
Dim csys As String
Dim returnValue As Integer
returnValue = instance.GetAllPoints(NumberNames,
	MyName, X, Y, Z, csys)
int GetAllPoints(
	int% NumberNames,
	array<String^>^% MyName,
	array<double>^% X,
	array<double>^% Y,
	array<double>^% Z,
	String^ csys = L"Global"
)
abstract GetAllPoints :
        NumberNames : int byref *
        MyName : string[] byref *
        X : float[] byref *
        Y : float[] byref *
        Z : float[] byref *
        ?csys : string
(* Defaults:
        let _csys = defaultArg csys "Global"
*)
-> int
Parameters
NumberNames
Type: System.Int32
MyName
Type: System.String[]
X
Type: System.Double[]
Y
Type: System.Double[]
Z
Type: System.Double[]
csys (Optional)
Type: System.String
Return Value
Type: Int32
Remarks
See Also
Reference
cPointObj Interface
ETABSv1 Namespace